MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_timer4_sevt.c
/*******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/******************************************************************************/
/** \file hc32f46x_timer4_sevt.c
 **
 ** A detailed description is available at
 ** @link Timer4SevtGroup Timer4SEVT description @endlink
 **
 **   - 2018-11-02  1.0 Hongjh First version for Device Driver Library of
 **                     Timer4SEVT.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f46x_timer4_sevt.h"
#include "hc32f46x_utility.h"

#if (DDL_TIMER4_SEVT_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup Timer4SevtGroup
 ******************************************************************************/

//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/*!< Parameter validity check for Timer4 unit  */
#define IS_VALID_TIMER4(__TMRx__) \
    ((M4_TMR41 == (__TMRx__)) ||  \
     (M4_TMR42 == (__TMRx__)) ||  \
     (M4_TMR43 == (__TMRx__)))

/*!< Parameter validity check for SEVT channel  */
#define IS_VALID_SEVT_CH(x)    \
    ((Timer4SevtCh0 == (x)) || \
     (Timer4SevtCh1 == (x)) || \
     (Timer4SevtCh2 == (x)) || \
     (Timer4SevtCh3 == (x)) || \
     (Timer4SevtCh4 == (x)) || \
     (Timer4SevtCh5 == (x)))

/*!< Parameter validity check for adct buffer mode  */
#define IS_VALID_SEVT_BUF_MODE(x)        \
    ((SevtBufDisable == (x)) ||          \
     (SevtBufCntZero == (x)) ||          \
     (SevtBufCntPeak == (x)) ||          \
     (SevtBufCntZeroOrCntPeak == (x)) || \
     (SevtBufCntZeroZicZero == (x)) ||   \
     (SevtBufCntPeakPicZero == (x)) ||   \
     (SevtBufCntZeroZicZeroOrCntPeakPicZero == (x)))

/*!< Parameter validity check for SEVT trigger event  */
#define IS_VALID_SEVT_TRG_EVT(x) \
    ((SevtTrgEvtSCMUH == (x)) || \
     (SevtTrgEvtSCMUL == (x)) || \
     (SevtTrgEvtSCMVH == (x)) || \
     (SevtTrgEvtSCMVL == (x)) || \
     (SevtTrgEvtSCMWH == (x)) || \
     (SevtTrgEvtSCMWL == (x)))

/*!< Parameter validity check for SEVT OCCR selection  */
#define IS_VALID_SEVT_OCCR_SEL(x) \
    ((SevtSelOCCRxh == (x)) ||    \
     (SevtSelOCCRxl == (x)))

/*!< Parameter validity check for SEVT running mode  */
#define IS_VALID_SEVT_MODE(x)      \
    ((SevtDelayTrigMode == (x)) || \
     (SevtCompareTrigMode == (x)))

/*!< Parameter validity check for SEVT mask time */
#define IS_VALID_SEVT_MSK(x)      \
    ((Timer4SevtMask0 == (x)) ||  \
     (Timer4SevtMask1 == (x)) ||  \
     (Timer4SevtMask2 == (x)) ||  \
     (Timer4SevtMask3 == (x)) ||  \
     (Timer4SevtMask4 == (x)) ||  \
     (Timer4SevtMask5 == (x)) ||  \
     (Timer4SevtMask6 == (x)) ||  \
     (Timer4SevtMask7 == (x)) ||  \
     (Timer4SevtMask8 == (x)) ||  \
     (Timer4SevtMask9 == (x)) ||  \
     (Timer4SevtMask10 == (x)) || \
     (Timer4SevtMask11 == (x)) || \
     (Timer4SevtMask12 == (x)) || \
     (Timer4SevtMask13 == (x)) || \
     (Timer4SevtMask14 == (x)) || \
     (Timer4SevtMask15 == (x)))

/*!< Get the specified register address of the specified Timer4 unit */
#define TMR4_SCCRx(__TMR4x__, __CH__) ((uint32_t) & (__TMR4x__)->SCCRUH + ((uint32_t)(__CH__)) * 4ul)
#define TMR4_SCSRx(__TMR4x__, __CH__) ((uint32_t) & (__TMR4x__)->SCSRUH + ((uint32_t)(__CH__)) * 4ul)
#define TMR4_SCMRx(__TMR4x__, __CH__) ((uint32_t) & (__TMR4x__)->SCMRUH + ((uint32_t)(__CH__)) * 4ul)

