MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_timer4_sevt.c
/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 *******************************************************************************
 ** \brief Initialize a Special-Event channel
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enCh                    Timer4 SEVT channel
 ** \arg Timer4SevtCh0                  Timer4 SEVT channel:0
 ** \arg Timer4SevtCh1                  Timer4 SEVT channel:1
 ** \arg Timer4SevtCh2                  Timer4 SEVT channel:2
 ** \arg Timer4SevtCh3                  Timer4 SEVT channel:3
 ** \arg Timer4SevtCh4                  Timer4 SEVT channel:4
 ** \arg Timer4SevtCh5                  Timer4 SEVT channel:5
 ** \param [in] pstcInitCfg             The pointer of SEVT configure structure
 ** \arg This parameter detail refer @ref stc_timer4_sevt_init_t
 **
 ** \retval Ok                          Initialize successfully
 ** \retval ErrorInvalidParameter If one of following conditions are met:
 **                                     - TMR4x is invalid
 **                                     - pstcInitCfg == NULL
 **                                     - enCh is invalid
 **                                     - Other invalid configuration
 **
 ******************************************************************************/
en_result_t TIMER4_SEVT_Init(M4_TMR4_TypeDef *TMR4x,
                             en_timer4_sevt_ch_t enCh,
                             const stc_timer4_sevt_init_t *pstcInitCfg)
{
    __IO uint16_t *pu16SCCR = NULL;
    __IO stc_tmr4_scsr_field_t stcSCSR_f;
    __IO stc_tmr4_scmr_field_t stcSCMR_f;
    __IO stc_tmr4_scsr_field_t *pstcSCSR_f = NULL;
    __IO stc_tmr4_scmr_field_t *pstcSCMR_f = NULL;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMR4x && pstcInitCfg pointer */
    if ((IS_VALID_TIMER4(TMR4x)) && (NULL != pstcInitCfg))
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_SEVT_CH(enCh));
        DDL_ASSERT(IS_VALID_SEVT_MODE(pstcInitCfg->enMode));
        DDL_ASSERT(IS_VALID_SEVT_BUF_MODE(pstcInitCfg->enBuf));
        DDL_ASSERT(IS_VALID_SEVT_MSK(pstcInitCfg->enMaskTimes));
        DDL_ASSERT(IS_VALID_SEVT_TRG_EVT(pstcInitCfg->enTrigEvt));
        DDL_ASSERT(IS_VALID_SEVT_OCCR_SEL(pstcInitCfg->enOccrSel));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInitCfg->enCmpAmcZicCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInitCfg->enCmpAmcPicCmd));

        enRet = Ok;
        /* Get actual address of register list of current channel */
        pu16SCCR = (__IO uint16_t *)TMR4_SCCRx(TMR4x, enCh);
        pstcSCSR_f = (__IO stc_tmr4_scsr_field_t *)TMR4_SCSRx(TMR4x, enCh);
        pstcSCMR_f = (__IO stc_tmr4_scmr_field_t *)TMR4_SCMRx(TMR4x, enCh);

        /* Configure default parameter */
        *pu16SCCR = (uint16_t)0u;
        *(__IO uint16_t *)pstcSCSR_f = (uint16_t)0x0000u;
        *(__IO uint16_t *)pstcSCMR_f = (uint16_t)0xFF00u;

        switch (pstcInitCfg->enBuf)
        {
        case SevtBufDisable:
            stcSCSR_f.BUFEN = (uint16_t)0u;
            stcSCSR_f.LMC = (uint16_t)0u;
            break;
        case SevtBufCntZero:
            stcSCSR_f.BUFEN = (uint16_t)1u;
            stcSCSR_f.LMC = (uint16_t)0u;
            break;
        case SevtBufCntPeak:
            stcSCSR_f.BUFEN = (uint16_t)2u;
            stcSCSR_f.LMC = (uint16_t)0u;
            break;
        case SevtBufCntZeroOrCntPeak:
            stcSCSR_f.BUFEN = (uint16_t)3u;
            stcSCSR_f.LMC = (uint16_t)0u;
            break;
        case SevtBufCntZeroZicZero:
            stcSCSR_f.BUFEN = (uint16_t)1u;
            stcSCSR_f.LMC = (uint16_t)1u;
            break;
        case SevtBufCntPeakPicZero:
            stcSCSR_f.BUFEN = (uint16_t)2u;
            stcSCSR_f.LMC = (uint16_t)1u;
            break;
        case SevtBufCntZeroZicZeroOrCntPeakPicZero:
            stcSCSR_f.BUFEN = (uint16_t)3u;
            stcSCSR_f.LMC = (uint16_t)1u;
            break;
        default:
            enRet = ErrorInvalidParameter;
            break;
        }

        if (Ok == enRet)
        {
            /* Configure start trigger output channel number */
            stcSCSR_f.EVTOS = (uint16_t)(pstcInitCfg->enTrigEvt);

            /* Select SEVT running mode */
            stcSCSR_f.EVTMS = (uint16_t)(pstcInitCfg->enMode);

            /* select OCO OCCR register: OCCR(x) */
            stcSCSR_f.EVTDS = (uint16_t)(pstcInitCfg->enOccrSel);

            /* Set the comparison with CNT interrupt mask counter */
            stcSCMR_f.AMC = (uint16_t)(pstcInitCfg->enMaskTimes);
            stcSCMR_f.MZCE = (uint16_t)(pstcInitCfg->enCmpAmcZicCmd);
            stcSCMR_f.MPCE = (uint16_t)(pstcInitCfg->enCmpAmcPicCmd);

            *pstcSCSR_f = stcSCSR_f;
            *pstcSCMR_f = stcSCMR_f;
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief De-Initialize a SEVT channel
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enCh                    Timer4 SEVT channel
 ** \arg Timer4SevtCh0                  Timer4 SEVT channel:0
 ** \arg Timer4SevtCh1                  Timer4 SEVT channel:1
 ** \arg Timer4SevtCh2                  Timer4 SEVT channel:2
 ** \arg Timer4SevtCh3                  Timer4 SEVT channel:3
 ** \arg Timer4SevtCh4                  Timer4 SEVT channel:4
 ** \arg Timer4SevtCh5                  Timer4 SEVT channel:5
 **
 ** \retval Ok                          De-Initialize successfully.
 ** \retval ErrorInvalidParameter       TMR4x is invalid
 **
 ******************************************************************************/
en_result_t TIMER4_SEVT_DeInit(M4_TMR4_TypeDef *TMR4x,
                               en_timer4_sevt_ch_t enCh)
{
    __IO uint16_t *pu16SCCR = NULL;
    __IO stc_tmr4_scsr_field_t *pstcSCSR_f = NULL;
    __IO stc_tmr4_scmr_field_t *pstcSCMR_f = NULL;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMR4x pointer */
    if (IS_VALID_TIMER4(TMR4x))
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_SEVT_CH(enCh));

        /* Get actual address of register list of current channel */
        pu16SCCR = (__IO uint16_t *)TMR4_SCCRx(TMR4x, enCh);
        pstcSCSR_f = (__IO stc_tmr4_scsr_field_t *)TMR4_SCSRx(TMR4x, enCh);
        pstcSCMR_f = (__IO stc_tmr4_scmr_field_t *)TMR4_SCMRx(TMR4x, enCh);

        /* Configure default parameter */
        *pu16SCCR = 0u;
        *(__IO uint16_t *)pstcSCSR_f = (uint16_t)0x0000u;
        *(__IO uint16_t *)pstcSCMR_f = (uint16_t)0xFF00u;

