MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_timer4_sevt.c
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Read compare value or delay value of ATVR
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enCh                    Timer4 SEVT channel
 ** \arg Timer4SevtCh0                  Timer4 SEVT channel:0
 ** \arg Timer4SevtCh1                  Timer4 SEVT channel:1
 ** \arg Timer4SevtCh2                  Timer4 SEVT channel:2
 ** \arg Timer4SevtCh3                  Timer4 SEVT channel:3
 ** \arg Timer4SevtCh4                  Timer4 SEVT channel:4
 ** \arg Timer4SevtCh5                  Timer4 SEVT channel:5
 **
 ** \retval Value of register SCCR
 **
 ******************************************************************************/
uint16_t TIMER4_SEVT_ReadSCCR(M4_TMR4_TypeDef *TMR4x,
                              en_timer4_sevt_ch_t enCh)
{
    __IO uint16_t *pu16SCCR = NULL;

    /* check parameters */
    DDL_ASSERT(IS_VALID_TIMER4(TMR4x));
    DDL_ASSERT(IS_VALID_SEVT_CH(enCh));

    /* Get actual address of register list of current channel */
    pu16SCCR = (__IO uint16_t *)TMR4_SCCRx(TMR4x, enCh);

    return *pu16SCCR;
}

/**
 *******************************************************************************
 ** \brief Set Timer4 SEVT trigger event.
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enCh                    Timer4 SEVT channel
 ** \arg Timer4SevtCh0                  Timer4 SEVT channel:0
 ** \arg Timer4SevtCh1                  Timer4 SEVT channel:1
 ** \arg Timer4SevtCh2                  Timer4 SEVT channel:2
 ** \arg Timer4SevtCh3                  Timer4 SEVT channel:3
 ** \arg Timer4SevtCh4                  Timer4 SEVT channel:4
 ** \arg Timer4SevtCh5                  Timer4 SEVT channel:5
 ** \param [in] enMaskTimes             Timer4 Special-EVT event mask times
 ** \arg Timer4SevtMask0                Mask 0 time.
 ** \arg Timer4SevtMask1                Mask 1 times.
 ** \arg Timer4SevtMask2                Mask 2 times.
 ** \arg Timer4SevtMask3                Mask 3 times.
 ** \arg Timer4SevtMask4                Mask 4 times.
 ** \arg Timer4SevtMask5                Mask 5 times.
 ** \arg Timer4SevtMask6                Mask 6 times.
 ** \arg Timer4SevtMask7                Mask 7 times.
 ** \arg Timer4SevtMask8                Mask 8 times.
 ** \arg Timer4SevtMask9                Mask 9 times.
 ** \arg Timer4SevtMask10               Mask 10 times
 ** \arg Timer4SevtMask11               Mask 11 times
 ** \arg Timer4SevtMask12               Mask 12 times
 ** \arg Timer4SevtMask13               Mask 13 times
 ** \arg Timer4SevtMask14               Mask 14 times
 ** \arg Timer4SevtMask15               Mask 15 times
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       TMR4x is invalid
 **
 ******************************************************************************/
en_result_t TIMER4_SEVT_SetMaskTimes(M4_TMR4_TypeDef *TMR4x,
                                     en_timer4_sevt_ch_t enCh,
                                     en_timer4_sevt_mask_t enMaskTimes)
{
    __IO stc_tmr4_scmr_field_t *pstcSCMR_f = NULL;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMR4x pointer */
    if (IS_VALID_TIMER4(TMR4x))
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_SEVT_CH(enCh));
        DDL_ASSERT(IS_VALID_SEVT_MSK(enMaskTimes));

        /* Get actual address of register list of current channel */
        pstcSCMR_f = (__IO stc_tmr4_scmr_field_t *)TMR4_SCMRx(TMR4x, enCh);
        pstcSCMR_f->AMC = (uint16_t)(enMaskTimes);

        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get Timer4 SEVT mask count.
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enCh                    Timer4 SEVT channel
 ** \arg Timer4SevtCh0                  Timer4 SEVT channel:0
 ** \arg Timer4SevtCh1                  Timer4 SEVT channel:1
 ** \arg Timer4SevtCh2                  Timer4 SEVT channel:2
 ** \arg Timer4SevtCh3                  Timer4 SEVT channel:3
 ** \arg Timer4SevtCh4                  Timer4 SEVT channel:4
 ** \arg Timer4SevtCh5                  Timer4 SEVT channel:5
 **
 ** \retval Timer4SevtMask0             Mask 0 time.
 ** \retval Timer4SevtMask1             Mask 1 times.
 ** \retval Timer4SevtMask2             Mask 2 times.
 ** \retval Timer4SevtMask3             Mask 3 times.
 ** \retval Timer4SevtMask4             Mask 4 times.
 ** \retval Timer4SevtMask5             Mask 5 times.
 ** \retval Timer4SevtMask6             Mask 6 times.
 ** \retval Timer4SevtMask7             Mask 7 times.
 ** \retval Timer4SevtMask8             Mask 8 times.
 ** \retval Timer4SevtMask9             Mask 9 times.
 ** \retval Timer4SevtMask10            Mask 10 times
 ** \retval Timer4SevtMask11            Mask 11 times
 ** \retval Timer4SevtMask12            Mask 12 times
 ** \retval Timer4SevtMask13            Mask 13 times
 ** \retval Timer4SevtMask14            Mask 14 times
 ** \retval Timer4SevtMask15            Mask 15 times
 **
 ******************************************************************************/
en_timer4_sevt_mask_t TIMER4_SEVT_GetMaskTimes(M4_TMR4_TypeDef *TMR4x,
                                               en_timer4_sevt_ch_t enCh)
{
    __IO stc_tmr4_scmr_field_t *pstcSCMR_f = NULL;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TIMER4(TMR4x));
    DDL_ASSERT(IS_VALID_SEVT_CH(enCh));

    /* Get actual address of register list of current channel */
    pstcSCMR_f = (__IO stc_tmr4_scmr_field_t *)TMR4_SCMRx(TMR4x, enCh);

    return (en_timer4_sevt_mask_t)pstcSCMR_f->AMC;
}

//@} // Timer4SevtGroup

#endif /* DDL_TIMER4_SEVT_ENABLE */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
